<?php
/**
 * 接口返回码
 *
 * ApiCode
 * 
 * @copyright chinamcloud.com
 * @author liuyunzhi
 * @time 2018-02-12
 * @version v1.0
 */
namespace app\library;

use yii;

class ApiCode{

    public static $code = array(
        10000 => '操作成功！',
        10001 => '非法请求类型！',
        10002 => '缺少方法名！',
        10003 => '缺少请求时间！',
        10004 => '缺少token值！',
        10005 => '授权验证失败！',
        10006 => '没有对应的接口！',
        10007 => '授权已失效！',
        10008 => '删除失败！请确认不是超级管理员。',
        10009 => '删除失败！请先删除此角色下的所有用户。',

        10012 => '没有收到参数数据！',
        10013 => 'json数据格式错误！',

        10025 => '指定参数不能为空！',
        10026 => '缺少相关参数！',

        99998 => '对不起，没有相关数据！',
        99999 => '操作失败！',
    );
}